CUsersHYPERPCDocuments1CDemoConversion1/src/Catalogs/Описания/Описания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Описания</name>
  <attributes>
    <name>НомерВерсииФормата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокОписания</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьСвойстваОбъектовВИсходномПорядке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОформлениеЗаголовков</name>
    <attributes>
      <name>Уровень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбразецОформления</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

CUsersHYPERPCDocuments1CDemoConversion1/src/Catalogs/Описания/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстОписания = Объект.Ссылка.ЗаголовокОписания.Получить();
		
		// Образцы заголовков
		Для Каждого СтрокаОформление Из Объект.Ссылка.ОформлениеЗаголовков Цикл
			ТекУровень = СтрокаОформление.Уровень;
			Если ТекУровень > 0 И ТекУровень <= 6 Тогда
				Если ТекУровень = 1 Тогда
					Заголовок1 = СтрокаОформление.ОбразецОформления.Получить();
				ИначеЕсли ТекУровень = 2 Тогда
					Заголовок2 = СтрокаОформление.ОбразецОформления.Получить();
				ИначеЕсли ТекУровень = 3 Тогда
					Заголовок3 = СтрокаОформление.ОбразецОформления.Получить();
				ИначеЕсли ТекУровень = 4 Тогда
					Заголовок4 = СтрокаОформление.ОбразецОформления.Получить();
				ИначеЕсли ТекУровень = 5 Тогда
					Заголовок5 = СтрокаОформление.ОбразецОформления.Получить();
				ИначеЕсли ТекУровень = 6 Тогда
					Заголовок6 = СтрокаОформление.ОбразецОформления.Получить();
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ВыборкаВерсииФормата = Справочники.ВерсииФормата.Выбрать();
	Пока ВыборкаВерсииФормата.Следующий() Цикл
		Элементы.НомерВерсииФормата.СписокВыбора.Добавить(ВыборкаВерсииФормата.Наименование);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ХранилищеФорматированногоДокумента = Новый ХранилищеЗначения(ТекстОписания);
	ТекущийОбъект.ЗаголовокОписания = ХранилищеФорматированногоДокумента;
	
	ТекущийОбъект.ОформлениеЗаголовков.Очистить();
	Для Ном=1 По 6 Цикл
		Если Ном = 1 Тогда
			ХранилищеФД = Новый ХранилищеЗначения(Заголовок1);
		ИначеЕсли Ном = 2 Тогда
			ХранилищеФД = Новый ХранилищеЗначения(Заголовок2);
		ИначеЕсли Ном = 3 Тогда
			ХранилищеФД = Новый ХранилищеЗначения(Заголовок3);
		ИначеЕсли Ном = 4 Тогда
			ХранилищеФД = Новый ХранилищеЗначения(Заголовок4);
		ИначеЕсли Ном = 5 Тогда
			ХранилищеФД = Новый ХранилищеЗначения(Заголовок5);
		ИначеЕсли Ном = 6 Тогда
			ХранилищеФД = Новый ХранилищеЗначения(Заголовок6);
		КонецЕсли;
		НовСтрока = ТекущийОбъект.ОформлениеЗаголовков.Добавить();
		НовСтрока.Уровень = Ном;
		НовСтрока.ОбразецОформления = ХранилищеФД;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПоказатьРезультат(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СообщПользователю = Новый СообщениеПользователю;
		СообщПользователю.Текст = НСтр("ru='Описание не записано'");
		СообщПользователю.Сообщить();
	КонецЕсли;
	
	ПоказатьРезультатНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВФайл(Команда)
	// Выбор Файла
	ДиалогВыбораФайла				=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	ДиалогВыбораФайла.Заголовок		=	НСтр("ru='Укажите расположение файла'");
	ДиалогВыбораФайла.Расширение	=	"html";
	ДиалогВыбораФайла.Фильтр		=	"*.html|*.html";


	Если ДиалогВыбораФайла.Выбрать() Тогда
		ИмяФайла = ДиалогВыбораФайла.ПолноеИмяФайла;
	Иначе
		Возврат;
	КонецЕсли;
	АдресХраненияРезультата = СохранитьВФайлНаСервере();

	ПолучитьФайл(АдресХраненияРезультата, ИмяФайла, Ложь);

КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПоказатьРезультатНаСервере()
	ТекстРезультат = Справочники.Описания.СформироватьДокументОписанияHTML(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Функция СохранитьВФайлНаСервере()
	ТекстРезультат = Справочники.Описания.СформироватьДокументОписанияHTML(Объект.Ссылка);
	ТХ = Новый ТекстовыйДокумент;
	ТХ.ДобавитьСтроку(ТекстРезультат);
	АдресНаСервере = ПолучитьИмяВременногоФайла("html");
	ТХ.Записать(АдресНаСервере, "windows-1251");
	АдресХранения = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(АдресНаСервере));
	УдалитьФайлы(АдресНаСервере);
	Возврат АдресХранения;
КонецФункции
#КонецОбласти
